authenticate-me/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def current_user
        # user whose `session_token` == token in `session` cookie
        @current_user ||= User.find_by(session_token: session[:session_token])